{
  "profile": {
    "name": "Robert Labancz",
    "label": "",
    "picture": "",
    "email": "sample@gmail.com",
    "phone": "123-123-1234",
    "website": "",
    "summary": "Software Engineering Manager",
    "location": "Bay Area",
    "username": "rlabancz",
    "socialMedia": [{
      "icon": "",
      "network": "",
      "username": "",
      "url": ""
    }]
  },
  "objective": {

  },
  "work": [{
    "company": "Tesla",
    "title": "Software Engineering Manager",
    "location": "Fremont, CA",
    "website": "https://www.tesla.com",
    "startDate": "Sept. 2022",
    "description": [
      "release + deployment",
      "architectured profile ia",
      "whats new",
      "qr code for hertz",
      "interchangable splash page",
      "automation testing",
      "migrated web functionalities to mobile",
      "react -> react native"
    ]
  },
    {
      "company": "",
      "title": "Staff Software Engineer",
      "location": "Fremont, CA",
      "website": "https://www.tesla.com",
      "startDate": "Nov. 2019",
      "endDate": "Sept. 2022",
      "description": [
 
        "architectured data driven logic",
        "managed team of 12", 
        "architectured runtime translation pulling (ttp node)",
        "added in-car purchase (bml)",
        "accessiblity",
        "launched leasing web platform",
        "ownership transfer",
        "led team + migrated and redesigned web applications from Drupal PHP to ",
        "Led the migration of accounts from calling SQL db to API based",
        "Launched Premium Connentiviy subscription service managment web tool",
        "Managed and navigated a company-wide RIF process, ensuring transparent communication, and compassionate support for affected and low-morale employees"
      ]
    },
    {
      "company": "",
      "title": "Senior Software Engineer",
      "location": "Fremont, CA",
      "website": "https://www.tesla.com",
      "startDate": "2017",
      "endDate": "Nov. 2019",
      "description": [
        "Implemented Cybertruck CSS theme to webpages and supported livestream event page",
        "Developed Tesla Insurance web platform using PHP, JavaScript",
        "Architected and developed a PHP boilerplate burst-app using Slim for other teams to extend off of",
        "Developed and supported Model Y livestream sign-up and livestream event page using Go as backend",
        "Advocated on design patterns to unify and enforce coding standards for CSS and JavaScript using lint rules",
        "Redesigned Tesla Shop product pages to provide a more visual appealing experience of accessories and clothing",
        "Assess and provide feedback to code reviews via Stash for various teams",
        "Using PHP and JavaScript, designed and built the Tesla Semi and Roadster reservation web pages within 1 week before a global unveiling",
        "Created Angular-based app via Smartling's API to upload English JSON strings & download translated files in a zip file",
        "Developed Solar Roof marketing, and reservation page for US product launch using SCSS and JavaScript",
        "Integrated SolarCity's development environment into Tesla's and advocated Tesla's coding standards and best practices",
        "Updated the Tesla Powerwall configurator using React and Drupal PHP to be able to take US orders"
      ]
    },
    {
      "company": "Avenue code",
      "title": "UI Developer",
      "location": "San Francisco, CA",
      "website": "https://www.avenuecode.com",
      "startDate": "2016",
      "endDate": "2017",
      "description": [
        "Worked as a consultant to Bloomingdale's",
        "Redesigned the Sign In and Profile Page section of the store website in a Lean Lab style",
        "Updated JavaScript & JSP-based webpages to a responsive design using Backbone and Marionette",
        "Revitalized webpage layout and design through the utilization of Handlebars, SCSS, and Foundation framework",
        "Participated in scrum meetings with stakeholders for informed decision-making aligning with company's value-per-feature approach"
      ]
    },
    {
      "company": "Genesys Telecommunications Laboratories",
      "title": "Mobile Developer",
      "location": "Markham, ON",
      "website": "https://www.genesys.com",
      "startDate": "2012",
      "endDate": "2016",
      "description": [
        "Contributed and lead company-wide initiative to implement a design framework with a unified look and feel to webapps, based on AngularJS and Bootstrap",
        "Interviewed, hired, managed, and mentored university interns",
        "Redesigned existing AJAX-based webpages with newly in-house created angular framework",
        "Developed cross-platform mobile push notification system for iOS / Android, integrated with Passbook distribution",
        "Designed and developed a webapp to render and modify Passbooks in real-time",
        "Built Jenkins build-server monitoring app to display analytics/statistics of unit test results using AngularJS & D3",
        "Developed 'Genesys Care' iOS & Android application for customers to keep track of customer support tickets",
        "Collaboratively developed Genesys SaaS Agent Monitoring webapp in a TDD style using Jasmine unit tests, and continuous integration using Jenkins build servers",
        "Created & designed application to login into websites based on credentials stored on NFC chip",
        "Demonstrated knowledge & interest in NFC by giving company-wide presentations on use cases and technical specs"
      ]
    },
    {
      "company": "Integral Group Inc.",
      "title": "Mobile Developer",
      "location": "Markham, CA",
      "website": "https://www.integralgroup.ca/",
      "startDate": "2010",
      "endDate": "2012",
      "description": [
        "Created the NexTaxi Android application to enable users to conveniently reserve and monitor the progress of their requested taxicabs. Seamless integration with the 'TranAir' application facilitates secure and efficient in-app payments.",
        "Developed Universal TranWare's 'TranAir' Android tablet application for taxicab operators to communicate with dispatch system via middleware and handle credit card transactions over Moneris APIs via a Bluetooth POS printer. Incorporated turn-by-turn navigation, and push-to-talk to dispatch within the application using Google APIs",
        "Demoed application and its functions at annual Taxi, Limousine & Para-transit Association exhibition in San Francisco"
      ]
    }
  ],
  "education": [{
    "institution": "University of Toronto",
    "area": "Major in Astrophysics and Physics, and Computer Science",
    "studyType": "Honours Bachelor of Science",
    "startDate": "2006",
    "endDate": "2011",
    "location": "Toronto, ON"
  }],
  "volunteer": [{
    "organization": "",
    "position": "",
    "location": "",
    "startDate": "",
    "endDate": "",
    "highlights": [
      ""
    ]
  }],
  "awards": [{
    "title": "",
    "date": "",
    "location": "",
    "awarder": "",
    "summary": [
      ""
    ]
  }],
  "publications": [{
    "name": "",
    "publisher": "",
    "releaseDate": "",
    "website": "",
    "summary": ""
  }],
  "skills": [{
    "name": "",
    "level": 5
  }],
  "personalSkills": [
    ""
  ],
  "languages": [{
    "language": "",
    "fluency": ""
  }],
  "interests": [{
    "name": ""
  }],
  "reference": [{
    "name": "",
    "position": "",
    "company": "",
    "address": [],
    "phone": "",
    "email": ""
  }]
}